<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="?,3,224,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx::Add_2541_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768" offset="0" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="onnx::Add_2541" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Add_2541">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_44302" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1536" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 3, 32, 32" offset="1560" size="4718592" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>3</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>3</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv1.weight">
					<dim>768</dim>
					<dim>3</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/conv1/Conv" type="Convolution" version="opset1">
			<data strides="32, 32" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>3</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv1/Conv_output_0">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="4720152" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Reshape_output_0">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_173" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="4720176" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Transpose_output_0">
					<dim>-1</dim>
					<dim>49</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="ShapeOf_49745" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>49</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_2_output_0,/Shape_3_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_49746" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4720200" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_49747" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4720200" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="14" name="Gather_49748" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_2_output_0,/Unsqueeze_2_output_0,/transformer/resblocks/resblocks.0/attn/Gather_1_output_0,/transformer/resblocks/resblocks.0/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.0/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.0/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.0/attn/Unsqueeze_9_output_0,/transformer/resblocks/resblocks.1/attn/Gather_1_output_0,/transformer/resblocks/resblocks.1/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.1/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.1/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.1/attn/Unsqueeze_9_output_0,/transformer/resblocks/resblocks.10/attn/Gather_1_output_0,/transformer/resblocks/resblocks.10/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.10/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.10/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.10/attn/Unsqueeze_9_output_0,/transformer/resblocks/resblocks.11/attn/Gather_1_output_0,/transformer/resblocks/resblocks.11/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.11/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.11/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.11/attn/Unsqueeze_9_output_0,/transformer/resblocks/resblocks.2/attn/Gather_1_output_0,/transformer/resblocks/resblocks.2/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.2/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.2/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.2/attn/Unsqueeze_9_output_0,/transformer/resblocks/resblocks.3/attn/Gather_1_output_0,/transformer/resblocks/resblocks.3/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.3/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.3/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.3/attn/Unsqueeze_9_output_0,/transformer/resblocks/resblocks.4/attn/Gather_1_output_0,/transformer/resblocks/resblocks.4/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.4/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.4/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.4/attn/Unsqueeze_9_output_0,/transformer/resblocks/resblocks.5/attn/Gather_1_output_0,/transformer/resblocks/resblocks.5/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.5/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.5/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.5/attn/Unsqueeze_9_output_0,/transformer/resblocks/resblocks.6/attn/Gather_1_output_0,/transformer/resblocks/resblocks.6/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.6/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.6/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.6/attn/Unsqueeze_9_output_0,/transformer/resblocks/resblocks.7/attn/Gather_1_output_0,/transformer/resblocks/resblocks.7/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.7/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.7/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.7/attn/Unsqueeze_9_output_0,/transformer/resblocks/resblocks.8/attn/Gather_1_output_0,/transformer/resblocks/resblocks.8/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.8/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.8/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.8/attn/Unsqueeze_9_output_0,/transformer/resblocks/resblocks.9/attn/Gather_1_output_0,/transformer/resblocks/resblocks.9/attn/Unsqueeze_12_output_0,/transformer/resblocks/resblocks.9/attn/Unsqueeze_15_output_0,/transformer/resblocks/resblocks.9/attn/Unsqueeze_21_output_0,/transformer/resblocks/resblocks.9/attn/Unsqueeze_9_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4720208" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_37497" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4720216" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_182" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4720200" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="18" name="/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_3_output_0,/Unsqueeze_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/Concat_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Maximum_44303" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/Add" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/Concat_2" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>49</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Concat_2_output_0">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_45937_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 50, 768" offset="4720224" size="76800" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_45937" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_1_output_0,/ln_pre/Cast_output_0">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_199" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4797024" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/ln_pre/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ln_pre/Div_output_0">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_45938_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="4797032" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_45938" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/ln_pre/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ln_pre/Mul_output_0">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_45939_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="4798568" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_45939" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/ln_pre/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ln_pre/Add_1_output_0,/ln_pre/Cast_1_output_0">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_213" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="4800104" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Transpose_1_output_0,/transformer/resblocks/resblocks.0/ln_1/Cast_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_45942_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2304" offset="4800128" size="4608" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_45942" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_216" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4797024" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/transformer/resblocks/resblocks.0/ln_1/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/ln_1/Div_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_45940_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="4804736" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_45940" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/transformer/resblocks/resblocks.0/ln_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/ln_1/Mul_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_45941_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="4806272" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_45941" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/transformer/resblocks/resblocks.0/ln_1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/ln_1/Add_1_output_0,/transformer/resblocks/resblocks.0/ln_1/Cast_1_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Transpose_44851_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2304, 768" offset="4807808" size="3538944" />
			<output>
				<port id="0" precision="FP16">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Transpose_44851" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/transformer/resblocks/resblocks.0/attn/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/MatMul_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/transformer/resblocks/resblocks.0/attn/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Add_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_50051" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8346752" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/transformer/resblocks/resblocks.0/attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_2_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/transformer/resblocks/resblocks.0/attn/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4720200" size="8" />
			<output>
				<port id="0" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Constant_16_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/transformer/resblocks/resblocks.0/attn/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_44370" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4720200" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Squeeze_44371" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_44372" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8346784" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/transformer/resblocks/resblocks.0/attn/Squeeze_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Squeeze_1_output_0">
					<dim>3</dim>
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4720200" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="59" name="Constant_301" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4720200" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="60" name="/transformer/resblocks/resblocks.0/attn/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Gather_3_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_50052" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="8346816" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/transformer/resblocks/resblocks.0/attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_3_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_423" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="4800104" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/transformer/resblocks/resblocks.0/attn/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Transpose_1_output_0">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_50054" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8346840" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/transformer/resblocks/resblocks.0/attn/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_6_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/transformer/resblocks/resblocks.0/attn/Constant_27_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="8346872" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/transformer/resblocks/resblocks.0/attn/Constant_27" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Constant_27_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/transformer/resblocks/resblocks.0/attn/Shape_6" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Shape_6_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/transformer/resblocks/resblocks.0/attn/Constant_25" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4797024" size="8" />
			<output>
				<port id="0" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Constant_25_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/transformer/resblocks/resblocks.0/attn/Constant_26" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8346874" size="8" />
			<output>
				<port id="0" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Constant_26_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Broadcast_829" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4720208" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_833_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4720200" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/transformer/resblocks/resblocks.0/attn/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Slice_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/transformer/resblocks/resblocks.0/attn/Cast_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Cast_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/transformer/resblocks/resblocks.0/attn/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Sqrt_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/transformer/resblocks/resblocks.0/attn/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Cast_3_output_0,/transformer/resblocks/resblocks.0/attn/Div_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/transformer/resblocks/resblocks.0/attn/Sqrt_1" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Sqrt_1_output_0,/transformer/resblocks/resblocks.0/attn/Sqrt_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/transformer/resblocks/resblocks.0/attn/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Mul_1_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/conv1/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4720208" size="8" />
			<output>
				<port id="0" precision="I64" names="/conv1/Constant_output_0" />
			</output>
		</layer>
		<layer id="81" name="Constant_303" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4720200" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="82" name="/transformer/resblocks/resblocks.0/attn/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Gather_4_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_50053" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="8346816" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/transformer/resblocks/resblocks.0/attn/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_4_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_538" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="4800104" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/transformer/resblocks/resblocks.0/attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Transpose_2_output_0">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_50055" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8346840" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/transformer/resblocks/resblocks.0/attn/Reshape_7" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_7_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_840" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8346882" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/transformer/resblocks/resblocks.0/attn/Transpose_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Transpose_4_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/transformer/resblocks/resblocks.0/attn/Mul_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Mul_2_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/transformer/resblocks/resblocks.0/attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/MatMul_1_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/transformer/resblocks/resblocks.0/attn/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Softmax_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4720216" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="95" name="Constant_305" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4720200" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="96" name="/transformer/resblocks/resblocks.0/attn/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Gather_5_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_50056" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="8346816" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/transformer/resblocks/resblocks.0/attn/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_5_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_653" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="4800104" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/transformer/resblocks/resblocks.0/attn/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Transpose_3_output_0">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_50057" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8346840" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/transformer/resblocks/resblocks.0/attn/Reshape_8" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_8_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/transformer/resblocks/resblocks.0/attn/MatMul_2" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/MatMul_2_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_849" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8346784" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/transformer/resblocks/resblocks.0/attn/Transpose_5" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Transpose_5_output_0">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Concat_24685" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="8346914" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/transformer/resblocks/resblocks.0/attn/Reshape_9" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_9_output_0">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="transformer.resblocks.0.attn.out_proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 768" offset="8346930" size="1179648" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="transformer.resblocks.0.attn.out_proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="transformer.resblocks.0.attn.out_proj.weight">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/transformer/resblocks/resblocks.0/attn/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_45943_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 768" offset="9526578" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_45943" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/transformer/resblocks/resblocks.0/attn/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Gemm_output_0">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_50058" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="9528114" size="24" />
