<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="text" type="Parameter" version="opset1">
			<data shape="?,77" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="text">
					<dim>-1</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="token_embedding.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="49408, 512" offset="0" size="50593792" />
			<output>
				<port id="0" precision="FP16">
					<dim>49408</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="token_embedding.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>49408</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="token_embedding.weight">
					<dim>49408</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_51149" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="50593792" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="4" name="/token_embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>49408</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>77</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/token_embedding/Gather_output_0">
					<dim>-1</dim>
					<dim>77</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_93843_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 77, 512" offset="50593800" size="78848" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>77</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_93843" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>77</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>77</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_output_0">
					<dim>-1</dim>
					<dim>77</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_51153" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="50672648" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>77</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Transpose_output_0,/transformer/resblocks/resblocks.0/ln_1/Cast_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_93846_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1536" offset="50672672" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_93846" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_51156" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="50675744" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/transformer/resblocks/resblocks.0/ln_1/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/ln_1/Div_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_93844_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="50675752" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_93844" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/transformer/resblocks/resblocks.0/ln_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/ln_1/Mul_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_93845_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="50676776" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_93845" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/transformer/resblocks/resblocks.0/ln_1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/ln_1/Add_1_output_0,/transformer/resblocks/resblocks.0/ln_1/Cast_1_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Transpose_92722_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1536, 512" offset="50677800" size="1572864" />
			<output>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Transpose_92722" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/transformer/resblocks/resblocks.0/attn/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/MatMul_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/transformer/resblocks/resblocks.0/attn/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Add_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_97929" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="52250664" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/transformer/resblocks/resblocks.0/attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_2_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/transformer/resblocks/resblocks.0/attn/Constant_18" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="50593792" size="8" />
			<output>
				<port id="0" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Constant_18_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/transformer/resblocks/resblocks.0/attn/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>77</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_92243" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="50593792" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Squeeze_92244" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_92245" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="52250696" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/transformer/resblocks/resblocks.0/attn/Squeeze_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Squeeze_1_output_0">
					<dim>3</dim>
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/transformer/resblocks/resblocks.0/attn/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="50593792" size="8" />
			<output>
				<port id="0" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Constant_output_0" />
			</output>
		</layer>
		<layer id="33" name="Constant_51243" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="50593792" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="34" name="/transformer/resblocks/resblocks.0/attn/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Gather_3_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_97930" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="52250728" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/transformer/resblocks/resblocks.0/attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_3_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_51365" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="50672648" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/transformer/resblocks/resblocks.0/attn/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Transpose_1_output_0">
					<dim>-1</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_97932" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="52250752" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/transformer/resblocks/resblocks.0/attn/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_6_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/transformer/resblocks/resblocks.0/attn/Constant_29_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="52250784" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/transformer/resblocks/resblocks.0/attn/Constant_29" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Constant_29_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/transformer/resblocks/resblocks.0/attn/Shape_6" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Shape_6_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/transformer/resblocks/resblocks.0/attn/Constant_27" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="50675744" size="8" />
			<output>
				<port id="0" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Constant_27_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/transformer/resblocks/resblocks.0/attn/Constant_28" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="52250786" size="8" />
			<output>
				<port id="0" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Constant_28_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Broadcast_51771" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="52250794" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_51775" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="50593792" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/transformer/resblocks/resblocks.0/attn/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Slice_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/transformer/resblocks/resblocks.0/attn/Cast_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Cast_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/transformer/resblocks/resblocks.0/attn/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Sqrt_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/transformer/resblocks/resblocks.0/attn/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Cast_3_output_0,/transformer/resblocks/resblocks.0/attn/Div_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/transformer/resblocks/resblocks.0/attn/Sqrt_1" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Sqrt_1_output_0,/transformer/resblocks/resblocks.0/attn/Sqrt_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/transformer/resblocks/resblocks.0/attn/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Mul_1_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="52250794" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="55" name="Constant_51245" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="50593792" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="56" name="/transformer/resblocks/resblocks.0/attn/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Gather_4_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_97931" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="52250728" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/transformer/resblocks/resblocks.0/attn/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_4_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_51480" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="50672648" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/transformer/resblocks/resblocks.0/attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Transpose_2_output_0">
					<dim>-1</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_97933" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="52250752" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/transformer/resblocks/resblocks.0/attn/Reshape_7" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_7_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_51782" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="52250802" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/transformer/resblocks/resblocks.0/attn/Transpose_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Transpose_4_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/transformer/resblocks/resblocks.0/attn/Mul_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Mul_2_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/transformer/resblocks/resblocks.0/attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/MatMul_1_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/transformer/resblocks/resblocks.0/attn/Constant_30_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 77, 77" offset="52250834" size="11858" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/transformer/resblocks/resblocks.0/attn/Constant_30" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Constant_30_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/transformer/resblocks/resblocks.0/attn/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Add_2_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/transformer/resblocks/resblocks.0/attn/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Softmax_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/transformer/resblocks/resblocks.0/attn/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="52262692" size="8" />
			<output>
				<port id="0" precision="I64" names="/transformer/resblocks/resblocks.0/attn/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="72" name="Constant_51247" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="50593792" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="73" name="/transformer/resblocks/resblocks.0/attn/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Gather_5_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_97934" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="52250728" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/transformer/resblocks/resblocks.0/attn/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_5_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_51595" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="50672648" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/transformer/resblocks/resblocks.0/attn/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Transpose_3_output_0">
					<dim>-1</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_97935" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="52250752" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/transformer/resblocks/resblocks.0/attn/Reshape_8" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_8_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/transformer/resblocks/resblocks.0/attn/MatMul_2" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/MatMul_2_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_51793" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="52250696" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/transformer/resblocks/resblocks.0/attn/Transpose_5" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Transpose_5_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Concat_75806" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="52262700" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/transformer/resblocks/resblocks.0/attn/Reshape_9" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_9_output_0">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="transformer.resblocks.0.attn.out_proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512" offset="52262716" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="transformer.resblocks.0.attn.out_proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="transformer.resblocks.0.attn.out_proj.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/transformer/resblocks/resblocks.0/attn/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_93847_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512" offset="52787004" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_93847" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/transformer/resblocks/resblocks.0/attn/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Gemm_output_0">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_97936" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="52788028" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/transformer/resblocks/resblocks.0/attn/Reshape_10" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/attn/Reshape_10_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/transformer/resblocks/resblocks.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/Add_output_0,/transformer/resblocks/resblocks.0/ln_2/Cast_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_93851_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="52788052" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_93851" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_93850_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2048" offset="52789076" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_93850" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_51882" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="50675744" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/transformer/resblocks/resblocks.0/ln_2/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/ln_2/Div_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_93848_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="52793172" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_93848" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/transformer/resblocks/resblocks.0/ln_2/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/ln_2/Mul_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_93849_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="52794196" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_93849" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/transformer/resblocks/resblocks.0/ln_2/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/ln_2/Add_1_output_0,/transformer/resblocks/resblocks.0/ln_2/Cast_1_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Transpose_92750_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2048, 512" offset="52795220" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Transpose_92750" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/transformer/resblocks/resblocks.0/mlp/c_fc/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/mlp/c_fc/MatMul_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/transformer/resblocks/resblocks.0/mlp/c_fc/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/mlp/c_fc/Add_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_92758_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="54892372" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="111" name="Constant_92758" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="112" name="/transformer/resblocks/resblocks.0/mlp/gelu/Mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/mlp/gelu/Mul_1_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Transpose_92761_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 2048" offset="54892374" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Transpose_92761" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/transformer/resblocks/resblocks.0/mlp/c_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/mlp/c_proj/MatMul_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/transformer/resblocks/resblocks.0/mlp/c_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/mlp/c_proj/Add_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/transformer/resblocks/resblocks.0/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/resblocks/resblocks.0/Add_1_output_0,/transformer/resblocks/resblocks.1/ln_1/Cast_output_0">
					<dim>77</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_93854_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1536" offset="56989526" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_93854" type="Convert" version="opset1">
